Repository: bgso7777/litten
Catalog: frontend/lib/l10n/app_*.arb
Languages: ps, zh

# appTitle
source: Litten
zh: 利腾

# homeTitle
source: Home
ps: کور
zh: 首页

# recordingTitle
source: Listen
ps: واورئ
zh: 听写

# writingTitle
source: Note
ps: وليکئ
zh: 写作

# settingsTitle
source: Settings
ps: تنظيمات
zh: 设置

source: Create Litten
ps: ليتن جوړ کړئ
zh: 创建笔记本

# emptyLittenTitle
source: Create or select a Litten
ps: يو ليتن جوړ کړئ يا غوره کړئ
zh: 创建或选择一个笔记本

# emptyLittenDescription
source: Use the 'Create Litten' button below to start your first note
ps: د خپل لومړي نوټ پيل کولو لپاره لاندې د 'ليتن جوړ کړئ' تڼۍ وکاروئ
zh: 使用下方的'创建笔记本'按钮开始您的第一个笔记

source: Start Recording
ps: ريکارډنګ پيل کړئ
zh: 开始录音

source: Stop Recording
ps: ريکارډنګ بند کړئ
zh: 停止录音

source: Recording...
ps: ريکارډنګ کوي...
zh: 录音中...

source: Text Writing
ps: د متن ليکلو
zh: 文字写作

source: Handwriting
ps: لاسي ليکنه
zh: 手写

source: Save
ps: ساتل
zh: 保存

source: Delete
ps: ړنګول
zh: 删除

source: Upgrade
ps: لوړول
zh: 升级

source: Remove Ads
ps: اعلانات لرې کړئ
zh: 移除广告

# freeVersion
source: Free
ps: وړيا
zh: 免费

# standardVersion
source: Standard
ps: معيار
zh: 标准

# premiumVersion
source: Premium
ps: پريميم
zh: 高级

source: Theme
ps: موضوع
zh: 主题

source: Language
ps: ژبه
zh: 语言

source: Classic Blue
ps: کلاسيک شين
zh: 经典蓝

source: Dark Mode
ps: تور حالت
zh: 深色模式

source: Nature Green
ps: طبيعي شين
zh: 自然绿

source: Sunset Orange
ps: د لمر ښکته کيدو نارنجي
zh: 日落橙

source: Monochrome Grey
ps: يو رنګ سور
zh: 单色灰

# accountAndSubscription
source: Account & Subscription
zh: 账户和订阅

source: User Status
zh: 用户状态

source: Usage Statistics
zh: 使用统计

source: App Settings
zh: 应用设置

source: Start Screen
zh: 开始屏幕

source: Recording Settings
zh: 录音设置

source: Max Recording Time
zh: 最大录音时间

source: Audio Quality
zh: 音频质量

source: Writing Settings
zh: 写作设置

source: Auto Save Interval
zh: 自动保存间隔

source: Default Font
zh: 默认字体

source: Free (with ads)
zh: 免费（含广告）

# standardMonthly
source: Standard ($4.99/month)
zh: 标准（$4.99/月）

# premiumMonthly
source: Premium ($9.99/month)
zh: 高级（$9.99/月）

# littensCount
source: littens
zh: 个笔记本

# filesCount
source: files
zh: 个文件

# removeAdsAndUnlimited
source: Remove ads and unlimited features
zh: 移除广告和无限功能

# maxRecordingTimeValue
source: 1 hour
zh: 1小时

# standardQuality
source: Standard
zh: 标准

# autoSaveIntervalValue
source: 3 minutes
zh: 3分钟

source: System Font
zh: 系统字体

# appVersion
source: Litten v1.0.0
zh: 利腾 v1.0.0

# appDescription
source: Cross-platform integrated note app
zh: 跨平台集成笔记应用

source: Close
zh: 关闭

source: Cancel
zh: 取消

source: Free user limits:
zh: 免费用户限制：

# maxLittens
source: • Litten
zh: • 笔记本

# maxRecordingFiles
source: • Recording files
zh: • 录音文件

# maxTextFiles
source: • Text files
zh: • 文本文件

# maxHandwritingFiles
source: • Handwriting files
zh: • 手写文件

# maxLittensLimit
source: Max 5
zh: 最多5个

# maxRecordingFilesLimit
source: Max 10
zh: 最多10个

# maxTextFilesLimit
source: Max 5
zh: 最多5个

# maxHandwritingFilesLimit
source: Max 5
zh: 最多5个

# upgradeToStandard
source: Upgrade to Standard Plan?
zh: 升级到标准计划？

# upgradeBenefits
source: • Remove ads • Unlimited littens and files • $4.99/month
zh: • 移除广告 • 无限笔记本和文件 • $4.99/月

# upgradedToStandard
source: Upgraded to Standard Plan! (Simulation)
zh: 已升级到标准计划！（模拟）

source: Select Theme
zh: 选择主题

source: Select Language
zh: 选择语言

source: Total files
zh: 总文件数

# noLittenSelected
source: Please select a Litten
zh: 请选择一个笔记本

# selectLittenFirst
source: To start listening, first select or create a Litten from the Home tab.
zh: 要开始听写，请先从首页选项卡选择或创建一个笔记本。

source: Go to Home
zh: 前往首页

source: No audio files yet
zh: 还没有音频文件

# startFirstRecording
source: Click the button below to start your first recording
zh: 点击下方按钮开始您的第一次录音

# selectLittenFirstMessage
source: Please select or create a Litten first.
zh: 请先选择或创建一个笔记本。

# recordingStoppedAndSaved
source: Recording stopped and file saved.
zh: 录音已停止并保存文件。

source: Recording started.
zh: 录音已开始。

# recordingFailed
source: Failed to start recording. Please check permissions.
zh: 录音启动失败。请检查权限。

source: Playback failed.
zh: 播放失败。

source: Delete File
zh: 删除文件

# confirmDeleteFile
source: Are you sure you want to delete the file {fileName}?
zh: 您确定要删除文件 {fileName} 吗？

source: File deleted.
zh: 文件已删除。

source: Select Playback Speed
zh: 选择播放速度

source: Playback Speed
zh: 播放速度

# recordingInProgress
source: Recording...
zh: 录音中...

source: Created
zh: 创建

source: Title
zh: 标题

source: Create
zh: 创建

# pleaseEnterTitle
source: Please enter a title.
zh: 请输入标题。

# littenCreated
source: {title} litten has been created.
zh: {title} 笔记本已创建。

source: Error
zh: 错误

source: Rename Litten
zh: 重命名笔记本

source: New Name
zh: 新名称

source: Change
zh: 更改

# littenRenamed
source: Litten name has been changed to '{newName}'.
zh: 笔记本名称已更改为 '{newName}'。

source: Delete Litten
zh: 删除笔记本

# confirmDeleteLitten
source: '{title}' litten will be deleted. This action cannot be undone and all related files will be deleted together.
zh: '{title}' 笔记本将被删除。 此操作无法撤销，所有相关文件将一起删除。

# littenDeleted
source: {title} litten has been deleted.
zh: {title} 笔记本已删除。

# freeUserLimitMessage
source: Free users can only create up to 5 littens. Upgrade to create unlimited!
zh: 免费用户最多只能创建5个笔记本。升级以创建无限数量！

# confirmDeleteLittenMessage
source: '{title}' litten will be deleted. This action cannot be undone and all related files will be deleted together.
zh: '{title}' 笔记本将被删除。 此操作无法撤销，所有相关文件将一起删除。

source: Default Litten
zh: 默认笔记本

source: Lecture
zh: 讲座

source: Meeting
zh: 会议

# defaultLittenDescription
source: Default space for files created without selecting a litten.
zh: 未选择笔记本时创建的文件将存储在此默认空间中。

# lectureDescription
source: Store files related to lectures here.
zh: 在此处存储与讲座相关的文件。

# meetingDescription
source: Store files related to meetings here.
zh: 在此处存储与会议相关的文件。

# welcomeDescription
source: Smart note app that integrates listen, write, and draw
zh: 集成听写、写作和手绘的 智能笔记应用

source: Listen
zh: 听写

# listenDescription
source: Voice recording and playback
zh: 语音录制和回放

source: Write
zh: 写作

# writeDescription
source: Text creation and editing
zh: 文本创建和编辑

source: Draw
zh: 手绘

# drawDescription
source: Handwriting on images
zh: 在图像上手写

# selectLanguageDescription
source: Please select the language to use in the app
zh: 请选择应用使用的语言

# themeRecommendationMessage
source: A recommended theme has been automatically selected based on your chosen language
zh: 已自动选择适合所选语言的推荐主题

source: Recommended
zh: 推荐

source: Previous
zh: 上一步

source: Next
zh: 下一步

source: Get Started
zh: 开始使用
